{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"xs_6:0": {"name": "xs_6:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "-1"}]}}, "xs_10": {"name": "xs_10:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "4"}, {"size": "-1"}, {"size": "-1"}]}}, "xs_2": {"name": "xs_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "19"}]}}, "xs_8:0": {"name": "xs_8:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "-1"}]}}, "xs_11": {"name": "xs_11:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "xs_3": {"name": "xs_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "27"}]}}, "xs_1": {"name": "xs_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}, "xs_4": {"name": "xs_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "76"}]}}, "xs_5": {"name": "xs_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "35"}]}}, "xs_7:0": {"name": "xs_7:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "-1"}]}}, "xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}, "xs_12": {"name": "xs_12:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}, "xs_9:0": {"name": "xs_9:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_2": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_0/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_9/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_8/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_2/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_17/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_16/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_4/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_21/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_20/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_6/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_25/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_24/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_8/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_29/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_28/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_10/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_13/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_12/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Cast_9/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_12/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/BroadcastTo_12/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/pjit__where_/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "27"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/BroadcastTo_3/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/transpose_5/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Cast_3/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "19"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_0/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "76"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_2/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/BroadcastTo_6/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/transpose_7/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_5/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_5/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_5/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/transpose_8/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Cast_5/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "35"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_3/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/BroadcastTo_9/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/transpose_10/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_7/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_7/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/strided_slice_7/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/transpose_11/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Cast_7/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Cast_8/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Reshape_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/BroadcastTo_13/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/BroadcastTo/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/...fhd_hdo-_...fho/pjit__einsum_/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_33/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/pjit_add_/BroadcastTo", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/Const_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/pjit__reduce_sum_/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/MultiHeadDense_0/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_11/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_10/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_19/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_18/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_5/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_23/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_22/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_7/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_27/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_26/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_9/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_31/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_30/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/Dense_11/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_15/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_arg_14/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/GeneralActorCriticRNN_0/pjit__squeeze_/Reshape/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_11/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_11/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_11/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_23/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_10/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_10/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_10/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_21/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_9/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_9/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_9/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_19/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_8/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_8/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_8/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_17/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_7/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_7/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_7/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_15/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_6/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_6/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_6/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_13/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_5/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_5/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_5/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_11/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_4/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_4/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_9/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_7/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_5/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/assert_equal_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "256"}]}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "xs_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "xs_10", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "4"}, {"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "xs_11", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "xs_12", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}, "inputs": []}, {"name": "xs_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "19"}]}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "xs_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "27"}]}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "xs_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "76"}]}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "xs_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "35"}]}}, "dtype": {"type": "DT_FLOAT"}}, "inputs": []}, {"name": "xs_6", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "xs_7", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "xs_8", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "xs_9", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_BOOL"}}, "inputs": []}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_9", "op": "Shape", "input": ["xs_10"], "attr": {"T": {"type": "DT_BOOL"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_10"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_8", "op": "Shape", "input": ["xs_10"], "attr": {"T": {"type": "DT_BOOL"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_10"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_10", "op": "Shape", "input": ["xs_11"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_11"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_11", "op": "Shape", "input": ["xs_12"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_12"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/pjit_tanh_/Tanh", "op": "_FusedMatMul", "input": ["xs_2", "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_0/Reshape"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-22"}, {"size": "19"}]}, {"dim": [{"size": "19"}, {"size": "252"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "VGFuaA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}, "inputs": ["xs_2", "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_0/Reshape"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape", "op": "Shape", "input": ["xs_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_2"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/pjit_tanh_/Tanh_1", "op": "_FusedMatMul", "input": ["xs_3", "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_1/Reshape"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-25"}, {"size": "27"}]}, {"dim": [{"size": "27"}, {"size": "252"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "VGFuaA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}, "inputs": ["xs_3", "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_1/Reshape"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_1", "op": "Shape", "input": ["xs_3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_3"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/pjit_tanh_/Tanh_2", "op": "_FusedMatMul", "input": ["xs_4", "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_2/Reshape"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-28"}, {"size": "76"}]}, {"dim": [{"size": "76"}, {"size": "252"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "VGFuaA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}, "inputs": ["xs_4", "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_2/Reshape"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_2", "op": "Shape", "input": ["xs_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_4"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/pjit_tanh_/Tanh_3", "op": "_FusedMatMul", "input": ["xs_5", "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_3/Reshape"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-31"}, {"size": "35"}]}, {"dim": [{"size": "35"}, {"size": "252"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "VGFuaA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}, "inputs": ["xs_5", "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Dense_3/Reshape"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_3", "op": "Shape", "input": ["xs_5"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_5"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_4", "op": "Shape", "input": ["xs_6"], "attr": {"T": {"type": "DT_BOOL"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_6"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_5", "op": "Shape", "input": ["xs_7"], "attr": {"T": {"type": "DT_BOOL"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_7"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_6", "op": "Shape", "input": ["xs_8"], "attr": {"T": {"type": "DT_BOOL"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}, "inputs": ["xs_8"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/concat_5", "op": "ConcatV2", "input": ["xs_7", "xs_6", "xs_8", "xs_9", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Cast_9/x"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_BOOL"}, "Tidx": {"type": "DT_INT32"}}, "inputs": ["xs_7", "xs_6", "xs_8", "xs_9", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticTransformerFlats/ActorCriticTransformerFlats/Cast_9/x"]}, {"name": "StatefulPartitionedCall/jax2tf_apply_/Shape_7", "op": "Shape", "input": ["xs_9"], "attr": 